### AWS UAT App plan Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/e11532b6-525e-4d2a-9d9f-61421df29713/terraform-bin show -no-color plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.s3_object_uat.aws_s3_bucket_object.this["about.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "about.html"
      ~ source_hash            = "ff5e64e2dfbfc9438652352f58e4680c" -> "f8d7073a9226c3e06ad85a9e073a4860"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["articles.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "articles.html"
      ~ source_hash            = "7a03a395fc5da3444f7f05dec1164e82" -> "97ac6ed93310cea6aae8e49ab5b63305"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["articles/learning-to-unit-test-en.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "articles/learning-to-unit-test-en.html"
      ~ source_hash            = "91fe43d64e24a2a102c15cfadc623455" -> "c8cdbdc7626c46b6385b093a7c5aa049"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["articles/learning-to-unit-test-es.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "articles/learning-to-unit-test-es.html"
      ~ source_hash            = "9e46af31927eba65f8131f328e3b27b6" -> "f679a13b786c92b106d1c7832ac0ad78"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-ec405511.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/About-ec405511.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/About-ec405511.js"
      + source_hash            = "d4753a839c423d909511d65853b58978"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-f6ed2526.js"] will be destroyed
  # (because key ["assets/About-f6ed2526.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "9fed6980641ecde2c9aa1a87907d58af" -> null
      - force_destroy          = true -> null
      - id                     = "assets/About-f6ed2526.js" -> null
      - key                    = "assets/About-f6ed2526.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/About-f6ed2526.js" -> null
      - source_hash            = "9fed6980641ecde2c9aa1a87907d58af" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-c7af1ddb.js"] will be destroyed
  # (because key ["assets/ArticleLayouts-c7af1ddb.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "f459b103de1dfc090bfc064c2ee30c6c" -> null
      - force_destroy          = true -> null
      - id                     = "assets/ArticleLayouts-c7af1ddb.js" -> null
      - key                    = "assets/ArticleLayouts-c7af1ddb.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/ArticleLayouts-c7af1ddb.js" -> null
      - source_hash            = "f459b103de1dfc090bfc064c2ee30c6c" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-d4aa01f3.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/ArticleLayouts-d4aa01f3.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/ArticleLayouts-d4aa01f3.js"
      + source_hash            = "3d8d65f506fcbae79b9a0d90bec36435"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-285ca014.js"] will be destroyed
  # (because key ["assets/Articles-285ca014.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "e418b248802d83ac9ad7bc1b2766ca9a" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Articles-285ca014.js" -> null
      - key                    = "assets/Articles-285ca014.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/Articles-285ca014.js" -> null
      - source_hash            = "e418b248802d83ac9ad7bc1b2766ca9a" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-2b5c5b73.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Articles-2b5c5b73.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Articles-2b5c5b73.js"
      + source_hash            = "1850dcce94578ef6115aa3b1ec367877"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-7a6fa8ba.js"] will be destroyed
  # (because key ["assets/Landing-7a6fa8ba.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "2f0946094f214b496e10d781d4288ad8" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Landing-7a6fa8ba.js" -> null
      - key                    = "assets/Landing-7a6fa8ba.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/Landing-7a6fa8ba.js" -> null
      - source_hash            = "2f0946094f214b496e10d781d4288ad8" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-d794a2b9.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Landing-d794a2b9.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Landing-d794a2b9.js"
      + source_hash            = "759621ca90b1adf93b99f2c8515ef96b"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-75e2b3b7.js"] will be destroyed
  # (because key ["assets/PDF-75e2b3b7.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "8e4a043c22d2a5ff7726b6b42588ddc6" -> null
      - force_destroy          = true -> null
      - id                     = "assets/PDF-75e2b3b7.js" -> null
      - key                    = "assets/PDF-75e2b3b7.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/PDF-75e2b3b7.js" -> null
      - source_hash            = "8e4a043c22d2a5ff7726b6b42588ddc6" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-a128da44.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/PDF-a128da44.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/PDF-a128da44.js"
      + source_hash            = "f32f53db257648521fb6fd590f8e2bef"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-688c7b98.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Start-688c7b98.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Start-688c7b98.js"
      + source_hash            = "83823f1f5a5229e96f0269ae0a739ea4"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-d99439a3.js"] will be destroyed
  # (because key ["assets/Start-d99439a3.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "73da5c5170264b0a7679572f66c1e979" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Start-d99439a3.js" -> null
      - key                    = "assets/Start-d99439a3.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/Start-d99439a3.js" -> null
      - source_hash            = "73da5c5170264b0a7679572f66c1e979" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartNav-8d8b46cd.js"] will be destroyed
  # (because key ["assets/StartNav-8d8b46cd.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "b1ce5d0b6fc7352905246fb357ab35d2" -> null
      - force_destroy          = true -> null
      - id                     = "assets/StartNav-8d8b46cd.js" -> null
      - key                    = "assets/StartNav-8d8b46cd.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/StartNav-8d8b46cd.js" -> null
      - source_hash            = "b1ce5d0b6fc7352905246fb357ab35d2" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartNav-8ecbae22.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/StartNav-8ecbae22.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/StartNav-8ecbae22.js"
      + source_hash            = "e1defd46fb3619d3b680eb4ba9f34b85"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/app-4ac8dfa2.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/app-4ac8dfa2.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/app-4ac8dfa2.js"
      + source_hash            = "be9b43016330b3c2018a4002538b19da"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/app-6f19e6c3.js"] will be destroyed
  # (because key ["assets/app-6f19e6c3.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "09c57d259ee48aab7e0235280a8819f1" -> null
      - force_destroy          = true -> null
      - id                     = "assets/app-6f19e6c3.js" -> null
      - key                    = "assets/app-6f19e6c3.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/app-6f19e6c3.js" -> null
      - source_hash            = "09c57d259ee48aab7e0235280a8819f1" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index.es-0f76a016.js"] will be destroyed
  # (because key ["assets/index.es-0f76a016.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "a83450a9926d9e43484902c5d1d8c745" -> null
      - force_destroy          = true -> null
      - id                     = "assets/index.es-0f76a016.js" -> null
      - key                    = "assets/index.es-0f76a016.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/index.es-0f76a016.js" -> null
      - source_hash            = "a83450a9926d9e43484902c5d1d8c745" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index.es-ad199f80.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/index.es-ad199f80.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/index.es-ad199f80.js"
      + source_hash            = "c09172b12186e636f8761d6178151c50"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/jquery.easing-93c65839.js"] will be destroyed
  # (because key ["assets/jquery.easing-93c65839.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "e812f5b1147b9292cbf8155ea33f7bc8" -> null
      - force_destroy          = true -> null
      - id                     = "assets/jquery.easing-93c65839.js" -> null
      - key                    = "assets/jquery.easing-93c65839.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/jquery.easing-93c65839.js" -> null
      - source_hash            = "e812f5b1147b9292cbf8155ea33f7bc8" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/jquery.easing-a49e264d.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/jquery.easing-a49e264d.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/jquery.easing-a49e264d.js"
      + source_hash            = "be463069a93b127e89539f5e132ac2d3"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["index.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "index.html"
      ~ source_hash            = "f8ec633b0e9412f2f6c181285e963b66" -> "d24801f407e0613bfee53487ddf7fa08"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["pdf.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "pdf.html"
      ~ source_hash            = "7c83c436f0f732b61bbc343f04c1b555" -> "e1b11a26f05d2c9807fca0692d4fbaff"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["resume.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "resume.html"
      ~ source_hash            = "afcd56250910184a0918821495474cbf" -> "5616e6a0ea42b56273c530182ca17471"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["sitemap.xml"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "sitemap.xml"
      ~ source_hash            = "5810baed62dcf094681ef62cda111012" -> "b1539fce1b1426641aaeda311612e71b"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["ssr-manifest.json"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "ssr-manifest.json"
      ~ source_hash            = "8b6a661b10bffe4245516ada3bc08524" -> "80e3c74ac71ea2a842a98f9c078b0c60"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

Plan: 10 to add, 9 to change, 10 to destroy.

Changes to Outputs:
  ~ s3_bucket_object_etags       = [
        # (4 unchanged elements hidden)
        "9e46af31927eba65f8131f328e3b27b6",
      - "9fed6980641ecde2c9aa1a87907d58af",
      - "f459b103de1dfc090bfc064c2ee30c6c",
      + (known after apply),
      + (known after apply),
        "33c3c94cc1859add12238311d16f6c1f",
      - "e418b248802d83ac9ad7bc1b2766ca9a",
      - "2f0946094f214b496e10d781d4288ad8",
      + (known after apply),
        "8c544421623ccc444b2ebb24e21604c6",
      - "8e4a043c22d2a5ff7726b6b42588ddc6",
      + (known after apply),
      + (known after apply),
        "460980a08fb6a7fb9af48988c5e5cc28",
      - "73da5c5170264b0a7679572f66c1e979",
      - "b1ce5d0b6fc7352905246fb357ab35d2",
      + (known after apply),
      + (known after apply),
        "35bc2af385e37e6def98966cb8b61301",
      - "09c57d259ee48aab7e0235280a8819f1",
      + (known after apply),
        "e60911495dba8bb96def57539a94e9cf",
        # (16 unchanged elements hidden)
        "f3b3742a10ca3e3bc76add45dcc7d52b",
      - "a83450a9926d9e43484902c5d1d8c745",
      - "e812f5b1147b9292cbf8155ea33f7bc8",
      + (known after apply),
      + (known after apply),
        "3af47f89e61fe763b909c1fabc4c4083",
        # (18 unchanged elements hidden)
    ]
  ~ s3_bucket_object_ids         = [
        # (4 unchanged elements hidden)
        "articles/learning-to-unit-test-es.html",
      - "assets/About-f6ed2526.js",
      - "assets/ArticleLayouts-c7af1ddb.js",
      + (known after apply),
      + (known after apply),
        "assets/Articles-0d8ebaa8.css",
      - "assets/Articles-285ca014.js",
      - "assets/Landing-7a6fa8ba.js",
      + (known after apply),
        "assets/Landing-a96b032e.css",
      - "assets/PDF-75e2b3b7.js",
      + (known after apply),
      + (known after apply),
        "assets/PDF-cd6aeca2.css",
      - "assets/Start-d99439a3.js",
      - "assets/StartNav-8d8b46cd.js",
      + (known after apply),
      + (known after apply),
        "assets/StartNav-cb1e6734.css",
      - "assets/app-6f19e6c3.js",
      + (known after apply),
        "assets/azure_devicon_forest_green-ee780a3a.svg",
        # (16 unchanged elements hidden)
        "assets/index-1cb490d5.css",
      - "assets/index.es-0f76a016.js",
      - "assets/jquery.easing-93c65839.js",
      + (known after apply),
      + (known after apply),
        "assets/powershell_devicon_forest_green-f06a1fda.svg",
        # (18 unchanged elements hidden)
    ]
  ~ s3_bucket_object_keys_ids    = [
        # (4 unchanged elements hidden)
        {
            id  = "articles/learning-to-unit-test-es.html"
            key = "articles/learning-to-unit-test-es.html"
        },
      ~ {
          ~ id  = "assets/About-f6ed2526.js" -> (known after apply)
          ~ key = "assets/About-f6ed2526.js" -> "assets/About-ec405511.js"
        },
      ~ {
          ~ id  = "assets/ArticleLayouts-c7af1ddb.js" -> (known after apply)
          ~ key = "assets/ArticleLayouts-c7af1ddb.js" -> "assets/ArticleLayouts-d4aa01f3.js"
        },
        {
            id  = "assets/Articles-0d8ebaa8.css"
            key = "assets/Articles-0d8ebaa8.css"
        },
      ~ {
          ~ id  = "assets/Articles-285ca014.js" -> (known after apply)
          ~ key = "assets/Articles-285ca014.js" -> "assets/Articles-2b5c5b73.js"
        },
      - {
          - id  = "assets/Landing-7a6fa8ba.js"
          - key = "assets/Landing-7a6fa8ba.js"
        },
        {
            id  = "assets/Landing-a96b032e.css"
            key = "assets/Landing-a96b032e.css"
        },
      ~ {
          ~ id  = "assets/PDF-75e2b3b7.js" -> (known after apply)
          ~ key = "assets/PDF-75e2b3b7.js" -> "assets/Landing-d794a2b9.js"
        },
      + {
          + id  = (known after apply)
          + key = "assets/PDF-a128da44.js"
        },
        {
            id  = "assets/PDF-cd6aeca2.css"
            key = "assets/PDF-cd6aeca2.css"
        },
      ~ {
          ~ id  = "assets/Start-d99439a3.js" -> (known after apply)
          ~ key = "assets/Start-d99439a3.js" -> "assets/Start-688c7b98.js"
        },
      ~ {
          ~ id  = "assets/StartNav-8d8b46cd.js" -> (known after apply)
          ~ key = "assets/StartNav-8d8b46cd.js" -> "assets/StartNav-8ecbae22.js"
        },
        {
            id  = "assets/StartNav-cb1e6734.css"
            key = "assets/StartNav-cb1e6734.css"
        },
      ~ {
          ~ id  = "assets/app-6f19e6c3.js" -> (known after apply)
          ~ key = "assets/app-6f19e6c3.js" -> "assets/app-4ac8dfa2.js"
        },
        {
            id  = "assets/azure_devicon_forest_green-ee780a3a.svg"
            key = "assets/azure_devicon_forest_green-ee780a3a.svg"
        },
        # (16 unchanged elements hidden)
        {
            id  = "assets/index-1cb490d5.css"
            key = "assets/index-1cb490d5.css"
        },
      ~ {
          ~ id  = "assets/index.es-0f76a016.js" -> (known after apply)
          ~ key = "assets/index.es-0f76a016.js" -> "assets/index.es-ad199f80.js"
        },
      ~ {
          ~ id  = "assets/jquery.easing-93c65839.js" -> (known after apply)
          ~ key = "assets/jquery.easing-93c65839.js" -> "assets/jquery.easing-a49e264d.js"
        },
        {
            id  = "assets/powershell_devicon_forest_green-f06a1fda.svg"
            key = "assets/powershell_devicon_forest_green-f06a1fda.svg"
        },
        # (18 unchanged elements hidden)
    ]
  ~ s3_bucket_object_version_ids = [
        "",
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "",
      + (known after apply),
        "",
      + (known after apply),
      + (known after apply),
        "",
      + (known after apply),
      + (known after apply),
        "",
      + (known after apply),
        "",
        # (16 unchanged elements hidden)
        "",
      + (known after apply),
      + (known after apply),
        "",
        # (5 unchanged elements hidden)
        "",
      + (known after apply),
      + (known after apply),
        "",
        # (3 unchanged elements hidden)
        "",
      + (known after apply),
        "",
        "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      + (known after apply),
      + (known after apply),
    ]
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["about.html"] will be updated in-place%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "about.html"%0A      ~ source_hash            = "ff5e64e2dfbfc9438652352f58e4680c" -> "f8d7073a9226c3e06ad85a9e073a4860"%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["articles.html"] will be updated in-place%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "articles.html"%0A      ~ source_hash            = "7a03a395fc5da3444f7f05dec1164e82" -> "97ac6ed93310cea6aae8e49ab5b63305"%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["articles/learning-to-unit-test-en.html"] will be updated in-place%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "articles/learning-to-unit-test-en.html"%0A      ~ source_hash            = "91fe43d64e24a2a102c15cfadc623455" -> "c8cdbdc7626c46b6385b093a7c5aa049"%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["articles/learning-to-unit-test-es.html"] will be updated in-place%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "articles/learning-to-unit-test-es.html"%0A      ~ source_hash            = "9e46af31927eba65f8131f328e3b27b6" -> "f679a13b786c92b106d1c7832ac0ad78"%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-ec405511.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/About-ec405511.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/About-ec405511.js"%0A      + source_hash            = "d4753a839c423d909511d65853b58978"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-f6ed2526.js"] will be destroyed%0A  # (because key ["assets/About-f6ed2526.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "uat.shortpoet.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "9fed6980641ecde2c9aa1a87907d58af" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/About-f6ed2526.js" -> null%0A      - key                    = "assets/About-f6ed2526.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/build/assets/About-f6ed2526.js" -> null%0A      - source_hash            = "9fed6980641ecde2c9aa1a87907d58af" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-c7af1ddb.js"] will be destroyed%0A  # (because key ["assets/ArticleLayouts-c7af1ddb.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "uat.shortpoet.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "f459b103de1dfc090bfc064c2ee30c6c" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/ArticleLayouts-c7af1ddb.js" -> null%0A      - key                    = "assets/ArticleLayouts-c7af1ddb.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/build/assets/ArticleLayouts-c7af1ddb.js" -> null%0A      - source_hash            = "f459b103de1dfc090bfc064c2ee30c6c" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-d4aa01f3.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/ArticleLayouts-d4aa01f3.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/ArticleLayouts-d4aa01f3.js"%0A      + source_hash            = "3d8d65f506fcbae79b9a0d90bec36435"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-285ca014.js"] will be destroyed%0A  # (because key ["assets/Articles-285ca014.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "uat.shortpoet.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "e418b248802d83ac9ad7bc1b2766ca9a" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/Articles-285ca014.js" -> null%0A      - key                    = "assets/Articles-285ca014.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/build/assets/Articles-285ca014.js" -> null%0A      - source_hash            = "e418b248802d83ac9ad7bc1b2766ca9a" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-2b5c5b73.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/Articles-2b5c5b73.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/Articles-2b5c5b73.js"%0A      + source_hash            = "1850dcce94578ef6115aa3b1ec367877"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-7a6fa8ba.js"] will be destroyed%0A  # (because key ["assets/Landing-7a6fa8ba.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "uat.shortpoet.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "2f0946094f214b496e10d781d4288ad8" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/Landing-7a6fa8ba.js" -> null%0A      - key                    = "assets/Landing-7a6fa8ba.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/build/assets/Landing-7a6fa8ba.js" -> null%0A      - source_hash            = "2f0946094f214b496e10d781d4288ad8" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-d794a2b9.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/Landing-d794a2b9.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/Landing-d794a2b9.js"%0A      + source_hash            = "759621ca90b1adf93b99f2c8515ef96b"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-75e2b3b7.js"] will be destroyed%0A  # (because key ["assets/PDF-75e2b3b7.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "uat.shortpoet.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "8e4a043c22d2a5ff7726b6b42588ddc6" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/PDF-75e2b3b7.js" -> null%0A      - key                    = "assets/PDF-75e2b3b7.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/build/assets/PDF-75e2b3b7.js" -> null%0A      - source_hash            = "8e4a043c22d2a5ff7726b6b42588ddc6" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-a128da44.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/PDF-a128da44.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/PDF-a128da44.js"%0A      + source_hash            = "f32f53db257648521fb6fd590f8e2bef"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-688c7b98.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/Start-688c7b98.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/Start-688c7b98.js"%0A      + source_hash            = "83823f1f5a5229e96f0269ae0a739ea4"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-d99439a3.js"] will be destroyed%0A  # (
  ```
  </details>
  *Pusher: @shortpoet, Action: `pull_request`, Working Directory: ``, Workflow: `App Infra`*